# Project Checkpoint 5 - Analytical Procedures for Analysts
## Group 3: Jiayi Fan, Jane Lee, Han Wang, Dinghao Xu, Jinyi Zhang, Yue Zhang

### Importing packages & data

In [1]:
import pandas as pd
from sqlalchemy import create_engine
import warnings
warnings.filterwarnings("ignore")

### Establish a connection & Create our tables

In [2]:
# Pass the connection string to a variable, conn_url
conn_url = 'postgresql://postgres:tRiR518,@localhost/project'

# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)

# Establish a connection
connection = engine.connect()

### 1. Type of Loan
#### 1a. How many loans have been made each month, group by loan type?

In [3]:
# Pass the SQL statement to create the view
stmt = """
    DROP VIEW IF EXISTS month_loans;
    
    CREATE VIEW month_loans AS
        SELECT m.month, s.type_of_Loan, sum(num_of_loan_type) as total_loans
        FROM customer_loan l
        JOIN customer_month m
        ON l.customer_id = m.customer_id
        JOIN loans s
        ON s.loan_id = l.loan_id 
        GROUP BY month, s.type_of_Loan
        ORDER BY month, s.type_of_Loan;

    SELECT * FROM month_loans;
"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
view_1a = pd.DataFrame(results, columns=column_names)
view_1a

    month             type_of_loan  total_loans
0       1                Auto Loan         4749
1       1      Credit-Builder Loan         5055
2       1  Debt Consolidation Loan         4847
3       1         Home Equity Loan         4888
4       1            Mortgage Loan         4867
..    ...                      ...          ...
75      8                  No Data         1426
76      8            Not Specified         4952
77      8              Payday Loan         5071
78      8            Personal Loan         4861
79      8             Student Loan         4871

[80 rows x 3 columns]

#### 1b. What is the delay payment rate for each type of loan?

In [4]:
# Pass the SQL statement to create the view
stmt = """
    DROP VIEW IF EXISTS loan_delay_payment_rate;
    
    CREATE VIEW loan_delay_payment_rate AS
        WITH t1 AS (
        SELECT *
        FROM loans JOIN customer_loan
        USING(loan_id)
        JOIN customer_month
        USING(customer_id)
        JOIN customer_delay
        USING (id)),

        t2 AS (
        SELECT type_of_loan, COUNT(*) AS total
        FROM t1
        GROUP BY type_of_loan),

        t3 AS (
        SELECT type_of_loan, COUNT(*) AS delay_total
        FROM t1
        WHERE payment_of_min_amount = 'No'
        GROUP BY type_of_loan)

        SELECT t2.type_of_loan, ROUND(CAST(delay_total AS numeric(7,2))/total, 3) AS delay_payment_rate
        FROM t2 JOIN t3
        USING(type_of_loan)
        ORDER BY delay_payment_rate DESC;

    SELECT * FROM loan_delay_payment_rate;
"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
view_1b = pd.DataFrame(results, columns=column_names)
view_1b

              type_of_loan delay_payment_rate
0                  No Data              0.639
1            Not Specified              0.230
2             Student Loan              0.230
3  Debt Consolidation Loan              0.229
4            Personal Loan              0.226
5            Mortgage Loan              0.225
6         Home Equity Loan              0.224
7      Credit-Builder Loan              0.224
8              Payday Loan              0.223
9                Auto Loan              0.221

#### 1c. What is the average number of days of delay for each type of loan?

In [5]:
# Pass the SQL statement to create the view
stmt = """
    DROP VIEW IF EXISTS loan_delay_from_due_date;
    
    CREATE VIEW loan_delay_from_due_date AS
        SELECT l.type_of_loan, ROUND(AVG(delay_from_due_date), 2) AS average_days_of_delay
        FROM customer_delay d
        JOIN customer_month m
        ON d.id = m.id 
        JOIN customer_loan c
        ON c.customer_id = m.customer_id 
        JOIN loans l
        ON l.loan_id = c.loan_id
        GROUP BY l.type_of_loan
        ORDER BY average_days_of_delay DESC;

    SELECT * FROM loan_delay_from_due_date;
"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
view_1c = pd.DataFrame(results, columns=column_names)
view_1c

              type_of_loan average_days_of_delay
0            Personal Loan                 25.42
1         Home Equity Loan                 25.40
2            Mortgage Loan                 25.38
3  Debt Consolidation Loan                 25.38
4                Auto Loan                 25.31
5              Payday Loan                 25.29
6             Student Loan                 25.25
7      Credit-Builder Loan                 25.14
8            Not Specified                 24.99
9                  No Data                 13.73

### 2. Delayed Payment
#### 2a. What is the delay payment rate for each occupation?

In [6]:
# Pass the SQL statement to create the view
stmt = """
    DROP VIEW IF EXISTS occupation_delay_payment_rate;
    
    CREATE VIEW occupation_delay_payment_rate AS
        SELECT occupation,
        ROUND(CAST(COUNT(CASE WHEN Payment_of_Min_Amount IN ('No') THEN 1 ELSE NULL END) AS numeric(7,2))
              /COUNT(d.id), 2) as delay_payment_rate
        FROM customer_delay d
        JOIN customer_month m
        ON d.id = m.id
        JOIN customers c
        ON c.customer_id = m.customer_id
        GROUP BY occupation 
        ORDER BY delay_payment_rate DESC 
        LIMIT 3;

    SELECT * FROM occupation_delay_payment_rate;
"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
view_2a = pd.DataFrame(results, columns=column_names)
view_2a

     occupation delay_payment_rate
0      Musician               0.38
1       Manager               0.38
2  Entrepreneur               0.37

#### 2b. Which age period has the highest delay payment rate?

In [7]:
# Pass the SQL statement to create the view
stmt = """
    DROP VIEW IF EXISTS age_delay_payment_rate;
    
    CREATE VIEW age_delay_payment_rate AS
        SELECT c.age_range, 
        ROUND(CAST(COUNT(CASE WHEN Payment_of_Min_Amount IN ('No') THEN 1 ELSE NULL END) AS numeric(7,2))
             /COUNT(d.id), 2) as delay_payment_rate
        FROM (SELECT *, CASE WHEN  age < 18 then 'Under 18'
                             WHEN age between 18 and 25 then '18-25'
                             WHEN age between 25 and 35 then '25-35'
                             WHEN age between 35 and 45 then '35-45'
                             WHEN age > 45 then 'Over 45'
                        END AS age_range
              FROM customers) AS c
        JOIN customer_month m
        ON c.customer_id = m.customer_id
        JOIN customer_delay d
        ON d.id = m.id
        GROUP BY c.age_range
        ORDER BY CASE WHEN c.age_range = 'Under 18' THEN 1
                      WHEN c.age_range = '18-25' THEN 2
                      WHEN c.age_range = '25-35' THEN 3
                      WHEN c.age_range = '35-45' THEN 4
                      WHEN c.age_range = 'Over 45' THEN 5
                 END;;

    SELECT * FROM age_delay_payment_rate;
"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
view_2b = pd.DataFrame(results, columns=column_names)
view_2b

  age_range delay_payment_rate
0  Under 18               0.00
1     18-25               0.33
2     25-35               0.33
3     35-45               0.32
4   Over 45               0.71

#### 2c. What monthly balance interval has the highest delay payment rate?

In [8]:
# Pass the SQL statement 
stmt = """
    DROP VIEW IF EXISTS monthly_balance_delay_payment_rate;
    
    CREATE VIEW monthly_balance_delay_payment_rate AS
        WITH t1 AS (
        SELECT id, monthly_balance,
        CASE WHEN monthly_balance >= 0 AND monthly_balance <200 THEN '0-199'
             WHEN monthly_balance >= 200 AND monthly_balance < 400 THEN '200-399'
             WHEN monthly_balance >= 400 AND monthly_balance < 600 THEN '400-599'
             WHEN monthly_balance >= 600 AND monthly_balance < 800 THEN '600-799'
             WHEN monthly_balance >= 800 AND monthly_balance < 1000 THEN '800-999'
             WHEN monthly_balance >= 1000 AND monthly_balance < 1200 THEN '1000-1999'
        END AS monthly_balance_interval
        FROM customer_monthly_balance),

        t2 AS (
        SELECT monthly_balance_interval, COUNT(*) AS total
        FROM t1 JOIN customer_delay
        USING(id) 
        GROUP BY monthly_balance_interval
        ORDER BY monthly_balance_interval),

        t3 AS (
        SELECT monthly_balance_interval, COUNT(*) AS delay_total
        FROM t1 JOIN customer_delay
        USING(id)
        WHERE payment_of_min_amount = 'No'
        GROUP BY monthly_balance_interval
        ORDER BY monthly_balance_interval)

        SELECT t2.monthly_balance_interval, ROUND(CAST(delay_total AS numeric(7,2))/total, 2) AS delay_payment_rate
        FROM t2 JOIN t3
        USING(monthly_balance_interval)
        ORDER BY delay_payment_rate DESC;
        
    SELECT * FROM monthly_balance_delay_payment_rate;
"""
# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

  monthly_balance_interval delay_payment_rate
0                1000-1999               0.75
1                  800-999               0.67
2                  600-799               0.56
3                  400-599               0.46
4                  200-399               0.27
5                    0-199               0.24

#### 2d. What is the average number of loans, number of bank accounts, and number of credit cards for customers that delayed their payments and those that did not?

In [9]:
# Pass the SQL statement 
stmt = """
    DROP VIEW IF EXISTS delay_payment_bank_info;
    
    CREATE VIEW delay_payment_bank_info AS
        SELECT payment_of_min_amount,
        ROUND(AVG(num_of_loan),2) AS average_num_of_loan, 
        ROUND(AVG(num_bank_accounts),2) AS average_num_bank_accounts, 
        ROUND(AVG(num_credit_card),2) AS average_num_credit_card
        FROM customer_bank_information JOIN customer_delay
        USING(id)
        GROUP BY payment_of_min_amount;
    
    SELECT * FROM delay_payment_bank_info;
"""
# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

,payment_of_min_amount,average_num_of_loan,average_num_bank_accounts,average_num_credit_card
0,No,2.00,3.53,4.49
1,NM,3.53,5.37,5.53
2,Yes,4.58,6.62,6.24

#### 2e. What is the delay payment rate for each type of payment behavior?

In [10]:
# Pass the SQL statement 
stmt = """
    DROP VIEW IF EXISTS payment_behavior_delay_payment_rate;
    
    CREATE VIEW payment_behavior_delay_payment_rate AS
        WITH t1 AS (
        SELECT *
        FROM customer_payment_behaviour JOIN customer_bank_information
        USING (behaviour_id)
        JOIN customer_delay
        USING(id)),

        t2 AS (
        SELECT payment_behaviour, COUNT(*) AS total
        FROM t1 
        GROUP BY payment_behaviour),

        t3 AS (
        SELECT payment_behaviour, COUNT(*) AS delay_total 
        FROM t1 
        WHERE payment_of_min_amount = 'No' 
        GROUP BY payment_behaviour)

        SELECT t2.payment_behaviour, ROUND(CAST(delay_total AS numeric(7,2))/total,2) AS delay_payment_rate
        FROM t2 JOIN t3
        USING(payment_behaviour)
        ORDER BY delay_payment_rate DESC;
    
    SELECT * FROM payment_behavior_delay_payment_rate;
"""
# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

                  payment_behaviour delay_payment_rate
0   High_spent_Large_value_payments               0.44
1  High_spent_Medium_value_payments               0.38
2    Low_spent_Large_value_payments               0.36
3   High_spent_Small_value_payments               0.36
4   Low_spent_Medium_value_payments               0.36
5    Low_spent_Small_value_payments               0.29

#### 2f. Find customers with the top 10 longest days of delay?

In [11]:
# Pass the SQL statement 
stmt = """
    DROP VIEW IF EXISTS delay_from_due_date_top_10;
    
    CREATE VIEW delay_from_due_date_top_10 AS
        SELECT DISTINCT name, delay_from_due_date, RNK
        FROM (SELECT name, delay_from_due_date, DENSE_RANK() OVER(ORDER BY delay_from_due_date DESC) AS RNK
        FROM customers JOIN customer_month
        USING (customer_id) 
        JOIN customer_delay
        USING (id)) AS t1
        WHERE RNK <= 10
        ORDER BY RNK;
        
    SELECT * FROM delay_from_due_date_top_10;
"""
# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

                   name  delay_from_due_date  rnk
0                 Alang                   62    1
1             Alawadhiw                   62    1
2            Alex Frewf                   62    1
3     Alexei Oreskovicq                   62    1
4                 Alexu                   62    1
...                 ...                  ...  ...
1895         all Gerrys                   53   10
1896                anz                   53   10
1897              asils                   53   10
1898           le Paull                   53   10
1899          ra Alperx                   53   10

[1900 rows x 3 columns]

### 3. Credit Score
#### 3a. What credit history age interval has the highest delay payment rate?

In [12]:
# Pass the SQL statement 
stmt = """
    DROP VIEW IF EXISTS credit_history_age_delay_payment_rate;
    
    CREATE VIEW credit_history_age_delay_payment_rate AS
        WITH t1 AS (
        SELECT id, 
        CASE WHEN credit_history_age >=0 AND credit_history_age < 100 THEN '0-99'
        WHEN credit_history_age >= 100 AND credit_history_age < 200 THEN '100-199'
        WHEN credit_history_age >= 200 AND credit_history_age < 300 THEN '200-299'
        WHEN credit_history_age >= 300 AND credit_history_age < 400 THEN '300-399'
        WHEN credit_history_age >= 400 AND credit_history_age < 500 THEN '400-499' 
        END AS credit_history_age_interval
        FROM customer_credit),

        t2 AS (
        SELECT credit_history_age_interval, COUNT(*) AS total
        FROM t1 JOIN customer_delay
        USING(id)
        GROUP BY credit_history_age_interval),

        t3 AS(
        SELECT credit_history_age_interval, COUNT(*) AS delay_total
        FROM t1 JOIN customer_delay
        USING(id)
        WHERE payment_of_min_amount = 'No'
        GROUP BY credit_history_age_interval)

        SELECT t2.credit_history_age_interval, 
        ROUND(CAST(delay_total AS numeric(7,2))/total,2) AS delay_payment_rate
        FROM t2 JOIN t3
        USING(credit_history_age_interval)
        ORDER BY delay_payment_rate DESC;
        
    SELECT * FROM credit_history_age_delay_payment_rate;
"""
# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

  credit_history_age_interval delay_payment_rate
0                     400-499               0.69
1                     300-399               0.65
2                     200-299               0.49
3                     100-199               0.10

#### 3b. What is the average number of bank accounts, number of credit cards, interest rate, and number of loans for each level of credit score?

In [13]:
# Pass the SQL statement to create the view
stmt = """
    DROP VIEW IF EXISTS credit_score_avg_interest_rate;
    
    CREATE VIEW credit_score_avg_interest_rate AS
        SELECT credit_score.credit_score, 
        ROUND(AVG(customer_bank_information.num_bank_accounts), 2) AS avg_num_bank_accounts,
        ROUND(AVG(customer_bank_information.num_credit_card), 2) AS avg_num_credit_card,
        ROUND(AVG(customer_bank_information.interest_rate), 2) AS avg_interest_rate,
        ROUND(AVG(customer_bank_information.num_of_loan), 2) AS avg_num_of_loan
        FROM customer_bank_information, customer_credit, credit_score
        WHERE credit_score.credit_score_id = customer_credit.credit_score_id
        AND customer_credit.id = customer_bank_information.id
        GROUP BY credit_score.credit_score
        ORDER BY CASE WHEN credit_score = 'Good' THEN 1
                      WHEN credit_score = 'Standard' THEN 2
                      WHEN credit_score = 'Poor' THEN 3
                 END;;

    SELECT * FROM credit_score_avg_interest_rate;
"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
view_3b = pd.DataFrame(results, columns=column_names)
view_3b

,credit_score,avg_num_bank_accounts,avg_num_credit_card,avg_interest_rate,avg_num_of_loan
0,Good,3.44,4.14,7.66,2.20
1,Standard,5.38,5.40,13.75,3.31
2,Poor,6.53,6.63,20.19,4.76

#### 3c. What is the top 5 occupation for each level of credit score?

In [14]:
# Pass the SQL statement to create the view
stmt = """
    DROP VIEW IF EXISTS credit_score_occupation;
    
    CREATE VIEW credit_score_occupation AS
        SELECT credit_score, occupation, credit_score_count
        FROM (SELECT credit_score, occupation, credit_score_count, 
              DENSE_RANK() OVER (PARTITION BY credit_score ORDER BY credit_score_count DESC) AS count_rank
              FROM (SELECT credit_score.credit_score, customers.occupation, 
                    COUNT(credit_score.credit_score) AS credit_score_count
                    FROM customers, customer_month, customer_credit, credit_score
                    WHERE customers.customer_id = customer_month.customer_id
                    AND customer_month.id = customer_credit.id
                    AND customer_credit.credit_score_id = credit_score.credit_score_id
                    GROUP BY credit_score.credit_score, customers.occupation
                    ORDER BY credit_score.credit_score, customers.occupation
                   ) AS A
              ORDER BY credit_score, count_rank
             ) AS B
        WHERE count_rank <= 5
        ORDER BY CASE WHEN credit_score = 'Good' THEN 1
                      WHEN credit_score = 'Standard' THEN 2
                      WHEN credit_score = 'Poor' THEN 3
                 END;;

    SELECT * FROM credit_score_occupation;
"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
view_3c = pd.DataFrame(results, columns=column_names)
view_3c

   credit_score     occupation  credit_score_count
0          Good       Engineer                1264
1          Good         Lawyer                1259
2          Good     Journalist                1254
3          Good  Media_Manager                1244
4          Good      Architect                1233
5      Standard         Doctor                3600
6      Standard         Lawyer                3872
7      Standard      Architect                3736
8      Standard  Media_Manager                3712
9      Standard       Mechanic                3625
10         Poor       Engineer                2094
11         Poor      Scientist                2062
12         Poor       Mechanic                2044
13         Poor     Accountant                2037
14         Poor   Entrepreneur                2033

#### 3d. What is the average annual income for each level of credit mix?

In [15]:
# Pass the SQL statement to create the view
stmt = """
    DROP VIEW IF EXISTS credit_mix_avg_annual_income;
    
    CREATE VIEW credit_mix_avg_annual_income AS
        SELECT credit_mix.credit_mix, ROUND(AVG(customers.annual_income), 2) AS avg_annual_income
        FROM customers, customer_annual_credit, credit_mix
        WHERE customers.customer_id = customer_annual_credit.customer_id
        AND customer_annual_credit.credit_mix_id = credit_mix.credit_mix_id
        GROUP BY credit_mix.credit_mix
        ORDER BY CASE WHEN credit_mix.credit_mix = 'Good' THEN 1
                      WHEN credit_mix.credit_mix = 'Standard' THEN 2
                      WHEN credit_mix.credit_mix = 'Bad' THEN 3
                 END;;

    SELECT * FROM credit_mix_avg_annual_income;
"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
view_3d = pd.DataFrame(results, columns=column_names)
view_3d

  credit_mix avg_annual_income
0       Good          68405.49
1   Standard          47732.47
2        Bad          32970.45

#### 3e. What is the average number of credit inquiries, credit history age, credit utilization ratio, days of delay, and number of delayed payments for each level of credit score?

In [16]:
# Pass the SQL statement to create the view
stmt = """
    DROP VIEW IF EXISTS credit_score_info;
    
    CREATE VIEW credit_score_info AS
        SELECT credit_score.credit_score, 
        ROUND(AVG(num_credit_inquiries), 2) AS ave_num_credit_inquiries, 
        ROUND(AVG(credit_history_age), 2) AS ave_credit_history_age, 
        ROUND(AVG(credit_utilization_ratio), 2) AS ave_credit_utilization_ratio,
        ROUND(AVG(delay_from_due_date), 2) AS ave_delay_from_due_date, 
        ROUND(AVG(num_of_delayed_payment), 2) AS ave_num_of_delayed_payment
        FROM customer_month, customer_credit, credit_score, customer_delay
        WHERE customer_month.id = customer_credit.id
        AND customer_credit.id = customer_delay.id
        AND customer_credit.credit_score_id = credit_score.credit_score_id
        GROUP BY credit_score.credit_score
        ORDER BY CASE WHEN credit_score.credit_score = 'Good' THEN 1
                      WHEN credit_score.credit_score = 'Standard' THEN 2
                      WHEN credit_score.credit_score = 'Poor' THEN 3
                 END;;

    SELECT * FROM credit_score_info;
"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
view_3e = pd.DataFrame(results, columns=column_names)
view_3e

,credit_score,ave_num_credit_inquiries,ave_credit_history_age,ave_credit_utilization_ratio,ave_delay_from_due_date,ave_num_of_delayed_payment
0,Good,3.30,284.77,32.69,10.96,8.56
1,Standard,5.34,227.81,32.31,19.76,13.54
2,Poor,8.18,170.06,31.99,29.73,15.81